---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
source: html/1fe933ae-e881-273a-fb8b-c4a7d9e66bc0.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d

Represents a color property of material.

## Syntax (C#)
```csharp
public class AssetPropertyDoubleArray4d : AssetProperty
```